Repository: jcthomsonjr/wischolar
Catalog: sites/all/modules/contrib-wisc/shib_auth/translations/*.po
Languages: hu

source: The Shibboleth authentication module lets you utilize the advantages of the Single Sign On (SSO) methods.
hu: A Shibboleth authentikációs modul használatával kihasználhatjuk a Single Sign On (SSO) azonosítás előnyeit.

source: For more help related to Shibboleth and module configuration, see <a href="@wiki">NIIF AAI wiki pages</a>.
hu: A Shibboleth és a modul beállításához a <a href="@wiki">NIIF AAI wiki</a>-n található segédlet

source: The text shown in the block and other login pages can be changed on the <a href="@block">block settings page</a>.
hu: A blokkban és a többi bejelentkező oldalon megjelenő szöveg megváltoztatható a <a href="@block">blokk beállításoknál</a>.

source: Your Drupal session has been destroyed because your SSO session is lost or expired.
hu: Az Ön Drupal munkamenetét megszüntettük, mert az SSO munkamenet elveszett vagy lejárt.

source: Username is missing. Please contact your Shibboleth administrator!
hu: Hiba a Shibboleth bejelentkezéskor - A felhasználónév nem található. Kérem lépjen kapcsolatba a Shibboleth adminisztrátorral.

source: Error saving user account. E-mail address is already used.
hu: Hiba a felhasználó adatainak mentése során. Ez az e-mail cím már foglalt ebben a Drupal rendszerben.

source: E-mail address is missing. Please contact your Shibboleth administrator!
hu: E-mail cím nem található. Kérem lépjen kapcsolatba a Shibboleth adminisztrátorral!

source: Shibboleth Login
hu: Shibboleth belépés

source: Shibboleth authentication
hu: Shibboleth azonosítás

source: Text of the auth link
hu: Az azonosítást elvégző hivatkozás szövege

source: Here you can replace the text of the authentication link.
hu: Itt módosíthatja azt a szöveget, amire kattintva a felhasználó azonosíthatja magát a Shibboleth segítségével

source: Shibboleth login
hu: Shibboleth belépés

source: Shibboleth handler settings
hu: Shibboleth handler beállítások

source: Attribute settings
hu: Attribútum beállítások

source: Shibboleth handler URL
hu: Shibboleth handler URL-je

source: The URL can be absolute or relative to the server base url: http://www.example.com/Shibboleth.sso; /Shibboleth.sso
hu: A cím lehet abszolút, vagy honlap gyökeréhez képest relatív Példák: http://www.example.com/Shibboleth.sso; /Shibboleth.sso

source: Shibboleth handler protocol
hu: A Shibboleth handler protokoll

source: This option will be effective only if the handler URL is a relative path.
hu: Ennek a beállításnak csak akkor van szerepe, ha a megadott URL relatív.

source: WAYF location
hu: WAYF helye

source: Server variable for username
hu: A felhasználónevet tartalmazó szerverváltozó

source: Server variable for e-mail address
hu: Az e-mail címet tartalmazó szerverváltozó

source: Allow e-mail address override
hu: E-mail cím felülbírálásának engedélyezése

source: Allow the IDP to override the locally stored e-mail addresses.
hu: Az IDP megbízása arra, hogy felülírja a helyben tárolt e-mail címeket a belépésnél.

source: Allow user define own e-mail address
hu: A felhasználó megadhatja az e-mail címét, ha szükséges

source: Allow the user to define her own e-mail addresses if the 'Allow e-mail address override' is disabled.
hu: Amennyiben az e-mail cím felülbírálása le van tiltva, a felhasználó saját maga adhatja meg e-mail címét.

source: Enable DEBUG mode.
hu: Debug mód engedélyezése

source: DEBUG path prefix
hu: A debug információk megejelenítése ezen előtag után

source: For example use 'user/' for display DEBUG messages on paths 'user/*'!
hu: Például a 'user/' előtag a 'user/*' -ben lévő tartalmaknál fogja kiirni a DEBUG információkat

source: Destroy Drupal session when the Shibboleth session expires.
hu: A Shibboleth munkamenet lejárata esetén a Drupal munkamenet megszüntetése

source: Change Logout settings
hu: Kijelentkezési beállítások

source: URL to redirect to after logout
hu: Link, amelyre kijelentkezés után a felhasználót továbbítja a rendszer

source: The URL can be absolute or relative to the server base url. The relative paths will be automatically extended with the site base URL.
hu: A link abszolút és a szerver címéhez képest relatív is lehet. A relatív linkek a szerver URL után írva kerülnek meghívásra.

source: Shibboleth settings
hu: Shibboleth beállítások

source: Settings of the Shibboleth authentication module
hu: A Shibboleth azonosítással kapcsolatos beállítások

source: General settings
hu: Általános beállítások

source: Shibboleth group rules
hu: Shibboleth csoport szabályok

source: Administer attribute-based role assignment
hu: Attribútum-alapú szerepek beállítása

source: Add new rule
hu: Új szabály hozzáadása

source: Add new attribute-based role assignment rule
hu: Új attribútum-alapú szerep-hozzárendelési szabály létrehozása

source: Please enter your email address
hu: Kérem adja meg e-mail címét

source: Send
hu: Küldés

source: You have to fill the 'E-mail' field.
hu: Kérem töltse ki az 'E-mail' mezőt

source: Clone
hu: Másolás

source: Edit
hu: Szerkeszt

source: Delete
hu: Töröl

source: There is no rule in the database
hu: Jelenleg nincs szabály az adatbázisban

source: Entry id
hu: Bejegyzés azonosítója

source: Shibboleth attribute name
hu: Shibboleth attribútum név

source: More properly: <b>$_SERVER</b> field name; enable DEBUG mode to list available fields. <br/>Note that it might differ from your users' fields.
hu: Helyesebben: <b>$_SERVER</b> mezőnév; a szerverváltozókat a debug mód bekapcsolásával tekintheti meg <br/>Kérjük, vegye figyelembe, hogy ezek különbözhetnek a felhasználók mezőneveitől.

source: Value (regexp)
hu: Érték (reguláris kifejezés)

source: Roles
hu: Szerepek

source: Your changes are saved.
hu: Elmentve.

source: administer shibboleth authentication
hu: Shibboleth azonosítás beállítása

source: Delete rule
hu: Szabály törlése

source: Edit rule
hu: Szabály módosítása

source: E-mail source settings
hu: E-mail cím bekérés

source: Require and use only Shibboleth-provided email address
hu: Kizárólag az IdP-től kapott e-mail cím használható

source: Ask for missing e-mail address
hu: Az e-mail cím bekérése a felhasználó regisztrációjakor, ha nem ismert

source: Shibboleth authentication module installed successfully.
hu: A Shibboleth azonosító modul telepítője sikeresen lefutott.

source: The Shibboleth authentication module was uninstalled successfully.
hu: A Shibboleth azonosító modul eltávolítása sikeres volt.

source: Storing shibboleth authentication rules
hu: Shibboleth azonosító szabályok tárolása

source: The shibboleth group rule's id.
hu: Szerep-hozzárendelési szabály azonosítója

source: The observed server variable.
hu: A vizsgált szerver változó

source: The joint regular expression.
hu: A reguláris kifejezés

source: The adjudicated role.
hu: A hozzárendelési szabály

source: Shibboleth authentication module.
hu: Shibboleth azonosító modul
